In [1]:
import pandas as pd

In [2]:
# 데이터 불러오기
df = pd.read_csv("ecommerce.csv")

print(df.shape)
df.head(3)

(500, 8)

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,mstephenson@fernandez.com,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,hduke@hotmail.com,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,pallen@yahoo.com,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505

열 Indexing

In [3]:
# indexing을 위한 대괄호 안에 들어갈 수 있는 요소의 값은 하나

print(['Time on App', 'Yearly Amount Spent']) # 2개의 텍스트 덩어리가 있는 하나의 리스트

df[['Time on App', 'Yearly Amount Spent']].head(3)

['Time on App', 'Yearly Amount Spent']

   Time on App  Yearly Amount Spent
0    12.655651           587.951054
1    11.109461           392.204933
2    11.330278           487.547505

In [4]:
# 사용하지 않는 하나의 열 삭제 
df.drop('Yearly Amount Spent', axis=1).columns

Index(['Email', 'Address', 'Avatar', 'Avg. Session Length', 'Time on App',
       'Time on Website', 'Length of Membership'],
      dtype='object')

In [5]:
# 사용하지 않는 두가지 이상 열 삭제 
df.drop(['Email', 'Yearly Amount Spent'], axis=1).columns

Index(['Address', 'Avatar', 'Avg. Session Length', 'Time on App',
       'Time on Website', 'Length of Membership'],
      dtype='object')

In [6]:
## 삭제된 열 반영

# 방법 1) 직접 할당
# df = df.drop(['Email', 'Yearly Amount Spent'], axis=1)

# 방법 2) 내부 파라미터 사용
df.drop(['Email', 'Yearly Amount Spent'], axis=1, inplace=True)

# 확인
df.head(3)

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
0,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621
1,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034
2,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543

행 Indexing

In [7]:
## 인덱스 이름 변경
df = df.head(10)

df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# 확인
df.head(3)

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
a,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621
b,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034
c,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543

In [8]:
# loc : 인덱스 이름을 사용하여 특정 행을 선택
df.loc['d']

Address                 1414 David Throughway\nPort Jason, OH 22070-1220
Avatar                                                       SaddleBrown
Avg. Session Length                                            34.305557
Time on App                                                    13.717514
Time on Website                                                36.721283
Length of Membership                                            3.120179
Name: d, dtype: object

In [9]:
df.loc['d':'f']

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179
e,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308
f,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507

In [10]:
# iloc : 0부터 시작하는 정수 인덱스를 사용하여 특정 행을 선택
df.iloc[3]

Address                 1414 David Throughway\nPort Jason, OH 22070-1220
Avatar                                                       SaddleBrown
Avg. Session Length                                            34.305557
Time on App                                                    13.717514
Time on Website                                                36.721283
Length of Membership                                            3.120179
Name: d, dtype: object

In [11]:
df.iloc[3:7]

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179
e,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308
f,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507
g,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017

숫자를 사용한 열 Indexing

In [12]:
df.iloc[6:]

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
g,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017
h,Unit 6538 Box 8980\nDPO AP 09026-4941,Aqua,32.739143,12.351959,37.373359,4.434273
i,"860 Lee Key\nWest Debra, SD 97450-0495",Salmon,33.987773,13.386235,37.534497,3.273434
j,"PSC 2734, Box 5255\nAPO AA 98456-7482",Brown,31.936549,11.814128,37.145168,3.202806

In [13]:
df.iloc[:3]

,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership
a,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621
b,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034
c,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543

In [14]:
df[:].shape

(10, 6)

In [15]:
df.iloc[1:4, 0:3]

,Address,Avatar,Avg. Session Length
b,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272
c,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915
d,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557

In [16]:
df.iloc[:, 1:4]

             Avatar  Avg. Session Length  Time on App
a            Violet            34.497268    12.655651
b         DarkGreen            31.926272    11.109461
c            Bisque            33.000915    11.330278
d       SaddleBrown            34.305557    13.717514
e  MediumAquaMarine            33.330673    12.795189
f       FloralWhite            33.871038    12.026925
g     DarkSlateBlue            32.021596    11.366348
h              Aqua            32.739143    12.351959
i            Salmon            33.987773    13.386235
j             Brown            31.936549    11.814128